package lesson3.extrahomework;
//Напишите программу вывода всех четных чисел от 2 до 100 включительно

public class Ex5Lesson3 {
    public static void main(String[] agrs){

        for(int i=2;i<=100;i+=2){
            System.out.println(" "+i+" ");
        }
    }
}
